Show / Hide Table of Contents
Class PlateElements
Data of plate elements
Inheritance
System.Object
PlateElements
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class PlateElements
Constructors
Improve this Doc   View Source
PlateElements()
Constructor
Declaration
public PlateElements()
Improve this Doc   View Source
PlateElements(Int32)
Constructor
Declaration
public PlateElements(int count)
Parameters
 Type |  Name |  Description
 System.Int32 |  count
Number of plate elements
Properties
Improve this Doc   View Source
Elements
List of fem elements for plate UID
Declaration
[DataMember]
public List<FemElement> Elements { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<FemElement>
Improve this Doc   View Source
PlateType
Type plate elements
Declaration
public StructuralPlateType PlateType { get; set; }
Property Value
 Type |  Description
 StructuralPlateType
Improve this Doc   View Source
PlateUID
Plate UID
Declaration
public int PlateUID { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source